{"id": "video_001", "transcript": "- Today, we're making the most classic side dish ever, these creamy, fluffy mashed potatoes. And if you liked this video, don't forget to hit that like button and subscribe. Hey, you're watching Preppy Kitchen where I John Kanell teach you how to make a delicious homemade dishes to share with your family and friends. These potatoes won't mash themselves. So let's get started. So you have two main options here. One would be Russet potatoes and the other one is Yukon Gold. Russet potatoes are gonna be really like fluffy and just come apart after they're boiled. Yukon Gold are creamy and amazing. These are my favorite potatoes. So I'm using them today but you could always use Russet or go 50, 50. If you're using Russet potatoes, they have a thick skin, so you definitely want to peal them. Yukon Gold potatoes have a thin skin so you don't need to worry about it, unless you don't like having skin on your potatoes. If you boiled a whole potato, it needs to cook for a long time before the center is nice and soft. That's a disaster for mashed potatoes. You don't want them to absorb a ton of water because when you mash them all their cells are totally full and they're gonna burst open and release starch. I'm cutting my potatoes into half inch thick slices. So cut them down the middle. And then you can either quarter them or make them into sixths or eighths, depending on how big your potatoes are. Once your potatoes are sliced, you have an optional delicious ingredient to use which is garlic. Just boiling some garlic with the potatoes is gonna add a ton of amazing flavor. So I highly recommend it. Grab four or five cloves of garlic and then give them a good smash to release their skin. And then just plop them in that pile of potatoes. Smashing the garlic gives it a headstart on releasing all those amazing oils. So it's actually better than chopping in this case. Another mistake people make is to have their pot of water boiling so everything happens faster but you do not want to do that. Place your potatoes and garlic into your pot. Then we're gonna add cold water and bring that to a boil. Fill your pot up with cold water so that the water is about an inch or two above the potato pieces. Now we're gonna take our potatoes to the burner and add about two teaspoons of salt. Place your potatoes over high heat and bring to a boil and then cook for about 10 minutes or until fork tender. You do not want to over cook the potatoes. And one of the reasons that we used cold water for these was so that they cook evenly. If you add them into boiling water, the outside would be overdone and the inside would still be hard. So my water's come to a boil. That means it's time to keep an eye on this. After about eight minutes, it's time to check your potatoes. So fish some out. I'm using a spider which is so convenient and give them a slice. Hmm, buttery, garlicky and perfect. Turn this off of heat. Drain your potatoes into a colander and then place them right back into the pot. Now it's time to place your pot over low heat. You want to remove some of the excess water from those potatoes because waterlogged potatoes do not mash deliciously. All right that's good. Now let's talk about the delicious things we're adding, mainly butter and milk. You can also use cream or half and half if you want this to be extra rich, it's up to you. I'm cutting one half a cup of butter or 113 grams into roughly tablespoon size pieces and adding it to my milk. We're just gonna microwave for four minutes so that it melts it and gets nice and warm. You do not want ice cold ingredients going into your mashed potatoes. My butter and milk are melted. Now it's time for the crucial step which is the mixing. Gonna pour it in and then use a wooden spoon to mix things together. Here we go. That's nice and mixed. It's time to mash. You do not want to over mix your potatoes because you're gonna burst the cells, they're gonna explode with starch. And you're gonna get gluey, gummy potatoes. Not fluffy, creamy, amazing, delicious potatoes. Depending on the texture you want, you can use a potato masher or a potato ricer. I like mine to be smoother. So this is a ricer. Gently mash down and don't overwork them. You're really just breaking the potatoes up into pieces that you would enjoy. You can have extra chunky or totally smooth. It's up to you but once they're mashed, it's good. Don't go overboard. Creamy and delicious but they could use some salt and pepper. So, some freshly cracked black pepper and I'm gonna give myself some salt, maybe half a teaspoon at a time. And of course, if you're using salted butter you would use less salt. If you liked this video, don't forget to check out my side dish playlist. Creamy, fluffy, garlicky perfection. I'll see you in the next video."}
{"id": "video_002", "transcript": "In this video I'll show you how to make crispy chicken..."}
